13/data/attachments/d7bb4f2e1fbf0f90.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_ab69a72f-1c6a-4c38-a8c0-fc7218d77eca</nif:username>
            <nif:friendToBeAdded>Courtney_future_Friend_39196_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>